kernel/mm/mm_series/phy_page_alloc.org
#+TITLE: 物理页面分配
#+AUTHOR: Cauchy(pqy7172@gmail.com)
#+EMAIL: pqy7172@gmail.com
#+HTML_HEAD: <link rel="stylesheet" href="../../../org-manual.css" type="text/css">

本文描述物理页面是如何管理和分配的．算法的原则就是二分伙伴分配器，和其它的分配器相比，伙伴分配器很快．

这种分配方案组合了二的指数分配器以及空闲块合并，其后的概念是很简单的．内存被划分为许多页面，以块组织在一起．每个块里的页面数量是2的幂次．如果某个块里的页面数量不可提供，一个更大的块就会被划分出一半，划出来的这两个块就称为相互的伙伴．其中一块被用来分配，另一块就是空闲的．块会被连续的以半划分，直到一个想要的大小可提供．当一个块随后释放掉时，伙伴就会被检测，如果也是空闲的话就会被合并．

本文先介绍了Linux是怎样记住哪些块是空闲的．随后分配和释放页面的细节将会被讨论到．最后会介绍到某些标志是怎样影响分配器行为的，以及分配器如何解决碎片化问题．

* 管理空闲块
* 分配页面
* 释放页面
* GFP标志
* 进程标志
* 避免碎片化
