kernel/mm/mm_series/phy_page_alloc.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2021-11-06 Sat 23:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>物理页面分配</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">物理页面分配</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org103854b">1. 管理空闲块</a></li>
<li><a href="#org2baf389">2. 分配页面</a></li>
<li><a href="#org310a5e0">3. 释放页面</a></li>
<li><a href="#org1679e06">4. GFP标志</a></li>
<li><a href="#org879152d">5. 进程标志</a></li>
<li><a href="#orgde4a308">6. 避免碎片化</a></li>
</ul>
</div>
</div>
<p>
本文描述物理页面是如何管理和分配的．算法的原则就是二分伙伴分配器，和其它的分配器相比，伙伴分配器很快．
</p>

<p>
这种分配方案组合了二的指数分配器以及空闲块合并，其后的概念是很简单的．内存被划分为许多页面，以块组织在一起．每个块里的页面数量是2的幂次．如果某个块里的页面数量不可提供，一个更大的块就会被划分出一半，划出来的这两个块就称为相互的伙伴．其中一块被用来分配，另一块就是空闲的．块会被连续的以半划分，直到一个想要的大小可提供．当一个块随后释放掉时，伙伴就会被检测，如果也是空闲的话就会被合并．
</p>

<p>
本文先介绍了Linux是怎样记住哪些块是空闲的．随后分配和释放页面的细节将会被讨论到．最后会介绍到某些标志是怎样影响分配器行为的，以及分配器如何解决碎片化问题．
</p>

<div id="outline-container-org103854b" class="outline-2">
<h2 id="org103854b"><span class="section-number-2">1</span> 管理空闲块</h2>
</div>
<div id="outline-container-org2baf389" class="outline-2">
<h2 id="org2baf389"><span class="section-number-2">2</span> 分配页面</h2>
</div>
<div id="outline-container-org310a5e0" class="outline-2">
<h2 id="org310a5e0"><span class="section-number-2">3</span> 释放页面</h2>
</div>
<div id="outline-container-org1679e06" class="outline-2">
<h2 id="org1679e06"><span class="section-number-2">4</span> GFP标志</h2>
</div>
<div id="outline-container-org879152d" class="outline-2">
<h2 id="org879152d"><span class="section-number-2">5</span> 进程标志</h2>
</div>
<div id="outline-container-orgde4a308" class="outline-2">
<h2 id="orgde4a308"><span class="section-number-2">6</span> 避免碎片化</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2021-11-06 Sat 23:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
